emacs.org
#+author: Salvatore Criscione
#+title: Emacs Configuration
#+language: en
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))
#+macro: word-count (eval (count-words (point-min) (point-max)))

[ Last revised and exported on *{{{latest-export-date}}}* with a word
  count of *{{{word-count}}}*. ]


* Preface
This is my personal emacs configuration, i strive to be:
- Minimal
- Build-in mostly
- Pretty

To apply just run: C-c C-v C-t

#+begin_src emacs-lisp :tangle no :results none
(org-babel-tangle)
#+end_src

To initial setup instead just do:

#+begin_src bash :tangle no :results none
stow -t ~/.emacs.d -R configs/emacs
#+end_src

* Create empty files
#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/early-init.el
;;; -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/init.el
;;; -*- lexical-binding: t -*-
#+end_src

* Early Init
** Sane defaults
These are some sane defaults which i like to use.

#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/early-init.el
  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize 'force
        frame-title-format '("%b")
        ring-bell-function 'ignore
        use-file-dialog nil
        use-short-answers t
        inhibit-splash-screen t
        inhibit-startup-screen t
        inhibit-x-resources t
        inhibit-startup-echo-area-message user-login-name ; read the docstring
        inhibit-startup-buffer-menu t)
#+end_src

** Minimal UI
Remove most of the clutter from Emacs UI...
#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/early-init.el
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
#+end_src

Remove the Scrollbar, Thanks to @Protesilaos for most of the config inspiration

#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/early-init.el
  (defun prot-emacs-no-minibuffer-scroll-bar (frame)
    "Remove the minibuffer scroll bars from FRAME."
    (when scroll-bar-mode
      (set-window-scroll-bars (minibuffer-window frame) nil nil nil nil :persistent)))

  (add-hook 'after-make-frame-functions #'prot-emacs-no-minibuffer-scroll-bar)
#+end_src

** Setup the packages in early-init

#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/early-init.el
  ;; Initialise installed packages at this early stage, by using the
  ;; available cache.  I had tried a setup with this set to nil in the
  ;; early-init.el, but (i) it ended up being slower and (ii) various
  ;; package commands, like `describe-package', did not have an index of
  ;; packages to work with, requiring a `package-refresh-contents'.
  (setq package-enable-at-startup t)
#+end_src

* Init.el
** Sane Defaults
*** Stop creating random files
By default emacs is creating files with absolute no reason, i prefer avoid the SSD to use too much write/read, so i disable.
#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/init.el
  (setq custom-file (locate-user-emacs-file "custom.el"))
  (load custom-file :no-error-if-file-is-missing)

  (require 'package)
  (package-initialize)

  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))

  (when (< emacs-major-version 29)
    (unless (package-installed-p 'use-package)
      (unless package-archive-contents
        (package-refresh-contents))
      (package-install 'use-package)))

  (add-to-list 'display-buffer-alist
               '("\\`\\*\\(Warnings\\|Compile-Log\\)\\*\\'"
                 (display-buffer-no-window)
                 (allow-no-window . t)))

    (setq make-backup-files nil)
    (setq backup-inhibited nil) ; Not sure if needed, given `make-backup-files'
    (setq create-lockfiles nil)
#+end_src

*** Make Native Comp silent
Stop telling me you are dooing things emacs
#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/init.el
  ;; Make native compilation silent.
  (when (native-comp-available-p)
    (setq native-comp-async-report-warnings-errors 'silent))
#+end_src

*** Startup Screen
Start from Scratch
#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/init.el
  (setq initial-buffer-choice (lambda ()
      (org-agenda-list 1)
      (get-buffer "*Org Agenda*")))
#+end_src

*** Fonts
Let's disable for now as I use the terminal mode
#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/init.el
;;  (add-to-list 'default-frame-alist
;;               '(font . "Tamzen-14"))
#+end_src

** Configs
*** Quit Everything
Thanks Prot for this useful function

#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/init.el
  (defun prot/keyboard-quit-dwim ()
    "Do-What-I-Mean behaviour for a general `keyboard-quit'.

  The generic `keyboard-quit' does not do the expected thing when
  the minibuffer is open.  Whereas we want it to close the
  minibuffer, even without explicitly focusing it.

  The DWIM behaviour of this command is as follows:

  - When the region is active, disable it.
  - When a minibuffer is open, but not focused, close the minibuffer.
  - When the Completions buffer is selected, close it.
  - In every other case use the regular `keyboard-quit'."
    (interactive)
    (cond
     ((region-active-p)
      (keyboard-quit))
     ((derived-mode-p 'completion-list-mode)
      (delete-completion-window))
     ((> (minibuffer-depth) 0)
      (abort-recursive-edit))
     (t
      (keyboard-quit))))

  (define-key global-map (kbd "C-g") #'prot/keyboard-quit-dwim)
#+end_src

*** 
* Features
** Git
#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/init.el
  ;; Magit
  (use-package magit
    :ensure t
    :config
    (setq magit-auto-revert-mode nil)
    (setq magit-save-repository-buffers 'dontask)
    :bind (("C-x g" . magit-status)))
#+end_src

** Remote Files
#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/init.el
  ;;; http://stackoverflow.com/questions/13794433/how-to-disable-autosave-for-tramp-buffers-in-emacs
  (setq tramp-auto-save-directory "/tmp")
#+end_src

** Dired
Some adjustment to Dired
#+begin_src emacs-lisp :tangle configs/emacs/init.el
  (use-package dired
    :ensure nil
    :commands (dired)
    :hook
    ((dired-mode . dired-hide-details-mode)
     (dired-mode . hl-line-mode))
    :config
    (setq dired-recursive-copies 'always)
    (setq dired-recursive-deletes 'always)
    (setq delete-by-moving-to-trash t)
    (setq dired-dwim-target t))
#+end_src
** Auto Complete
*** Vertico
Better selection
#+begin_src emacs-lisp :tangle configs/emacs/init.el
  (use-package vertico
    :ensure t
    :hook (after-init . vertico-mode))
#+end_src
#+begin_src emacs-lisp :tangle configs/emacs/init.el
  (use-package marginalia
    :ensure t
    :hook (after-init . marginalia-mode))
#+end_src
#+begin_src emacs-lisp :tangle configs/emacs/init.el
  (use-package orderless
    :ensure t
    :config
    (setq completion-styles '(orderless basic))
    (setq completion-category-defaults nil)
    (setq completion-category-overrides nil))
#+end_src
#+begin_src emacs-lisp :tangle configs/emacs/init.el
  (use-package savehist
    :ensure nil ; it is built-in
    :hook (after-init . savehist-mode))
#+end_src

* Packages
** Theme
#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/init.el
(use-package tao-theme
  :ensure t
  :config
  (load-theme 'tao-yang t))
#+end_src

** Treemacs

#+begin_src emacs-lisp :mkdirp yes :tangle configs/emacs/init.el
(use-package treemacs
  :ensure t
  :defer t
  :init
  (with-eval-after-load 'winum
    (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
  :config
  (progn
    (setq treemacs-buffer-name-function            #'treemacs-default-buffer-name
          treemacs-buffer-name-prefix              " *Treemacs-Buffer-"
          treemacs-collapse-dirs                   (if treemacs-python-executable 3 0)
          treemacs-deferred-git-apply-delay        0.5
          treemacs-directory-name-transformer      #'identity
          treemacs-display-in-side-window          t
          treemacs-eldoc-display                   'simple
          treemacs-file-event-delay                2000
          treemacs-file-extension-regex            treemacs-last-period-regex-value
          treemacs-file-follow-delay               0.2
          treemacs-file-name-transformer           #'identity
          treemacs-follow-after-init               t
          treemacs-expand-after-init               t
          treemacs-find-workspace-method           'find-for-file-or-pick-first
          treemacs-git-command-pipe                ""
          treemacs-goto-tag-strategy               'refetch-index
          treemacs-header-scroll-indicators        '(nil . "^^^^^^")
          treemacs-hide-dot-git-directory          t
          treemacs-hide-dot-jj-directory           t
          treemacs-indentation                     2
          treemacs-indentation-string              " "
          treemacs-is-never-other-window           nil
          treemacs-max-git-entries                 5000
          treemacs-missing-project-action          'ask
          treemacs-move-files-by-mouse-dragging    t
          treemacs-move-forward-on-expand          nil
          treemacs-no-png-images                   nil
          treemacs-no-delete-other-windows         t
          treemacs-project-follow-cleanup          nil
          treemacs-persist-file                    (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
          treemacs-position                        'left
          treemacs-read-string-input               'from-child-frame
          treemacs-recenter-distance               0.1
          treemacs-recenter-after-file-follow      nil
          treemacs-recenter-after-tag-follow       nil
          treemacs-recenter-after-project-jump     'always
          treemacs-recenter-after-project-expand   'on-distance
          treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
          treemacs-project-follow-into-home        nil
          treemacs-show-cursor                     nil
          treemacs-show-hidden-files               nil
          treemacs-silent-filewatch                nil
          treemacs-silent-refresh                  nil
          treemacs-sorting                         'alphabetic-asc
          treemacs-select-when-already-in-treemacs 'move-back
          treemacs-space-between-root-nodes        t
          treemacs-tag-follow-cleanup              t
          treemacs-tag-follow-delay                1.5
          treemacs-text-scale                      nil
          treemacs-user-mode-line-format           nil
          treemacs-user-header-line-format         nil
          treemacs-wide-toggle-width               70
          treemacs-width                           35
          treemacs-width-increment                 1
          treemacs-width-is-initially-locked       t
          treemacs-workspace-switch-cleanup        nil)

    ;; The default width and height of the icons is 22 pixels. If you are
    ;; using a Hi-DPI display, uncomment this to double the icon size.
    ;;(treemacs-resize-icons 44)

    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-fringe-indicator-mode 'always)
    (when treemacs-python-executable
      (treemacs-git-commit-diff-mode t))

    (pcase (cons (not (null (executable-find "git")))
                 (not (null treemacs-python-executable)))
      (`(t . t)
       (treemacs-git-mode 'deferred))
      (`(t . _)
       (treemacs-git-mode 'simple)))

    (treemacs-hide-gitignored-files-mode nil))
  :bind
  (:map global-map
        ("M-0"       . treemacs-select-window)
        ("C-x t 1"   . treemacs-delete-other-windows)
        ("C-x t t"   . treemacs)
        ("C-x t d"   . treemacs-select-directory)
        ("C-x t B"   . treemacs-bookmark)
        ("C-x t C-t" . treemacs-find-file)
        ("C-x t M-t" . treemacs-find-tag)))

(use-package treemacs-icons-dired
  :hook (dired-mode . treemacs-icons-dired-enable-once)
  :ensure t)

(use-package treemacs-magit
  :after (treemacs magit)
  :ensure t)

(use-package treemacs-tab-bar ;;treemacs-tab-bar if you use tab-bar-mode
  :after (treemacs)
  :ensure t
  :config (treemacs-set-scope-type 'Tabs))

(treemacs-start-on-boot)
#+end_src

** Spacious Padding
#+begin_src emacs-lisp :tangle configs/emacs/init.el
  (use-package spacious-padding
    :ensure nil
    :load-path "~/.emacs.d/packages/spacious-padding"
    :config
    ;; These are the default values, but I keep them here for visibility.
    ;; Also check `spacious-padding-subtle-frame-lines'.
    (setq spacious-padding-widths
          '( :internal-border-width 16
             :header-line-width 0
             :mode-line-width 0
             :custom-button-width 3
             :tab-width 4
             :right-divider-width 16
             :scroll-bar-width 8
             :fringe-width 8))

    (spacious-padding-mode 1)

    ;; Set a key binding if you need to toggle spacious padding.
    (define-key global-map (kbd "<f8>") #'spacious-padding-mode))
#+end_src

** Nyan

#+begin_src emacs-lisp :tangle configs/emacs/init.el
  (use-package nyan-mode
    :ensure t
    :config
    (nyan-mode))
#+end_src
